---
kind: type
id: T:Autodesk.Revit.UI.ToggleButtonData
source: html/ca92168b-f675-ce48-f1e3-fd5640762ad8.htm
---
# Autodesk.Revit.UI.ToggleButtonData

This class contains information necessary to construct a toggle button in a RadioButtonGroup.

## Syntax (C#)
```csharp
public class ToggleButtonData : PushButtonData
```